{"weightsManifest": [{"paths": ["group1-shard1of7.bin", "group1-shard2of7.bin", "group1-shard3of7.bin", "group1-shard4of7.bin", "group1-shard5of7.bin", "group1-shard6of7.bin", "group1-shard7of7.bin"], "weights": [{"name": "module_apply_default/Encoder_en/hidden_layers/l2_normalize/Maximum/y", "shape": [], "dtype": "float32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv2/Tensordot/Reshape_1", "shape": [1536, 512], "dtype": "float32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv1/Tensordot/Reshape_1", "shape": [512, 1536], "dtype": "float32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_1/TransformerLayer/FFN/layer_prepostprocess/layer_norm/layer_norm_bias/ConcatPartitions/concat", "shape": [512], "dtype": "float32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_1/TransformerLayer/FFN/layer_prepostprocess/layer_norm/layer_norm_scale/ConcatPartitions/concat", "shape": [512], "dtype": "float32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_1/TransformerLayer/FFN/conv1/bias/ConcatPartitions/concat", "shape": [1536], "dtype": "float32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_1/TransformerLayer/FFN/conv2/bias/ConcatPartitions/concat", "shape": [512], "dtype": "float32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/mul/y", "shape": [], "dtype": "float32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_1/TransformerLayer/layer_prepostprocess/layer_norm/layer_norm_bias/ConcatPartitions/concat", "shape": [512], "dtype": "float32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_1/TransformerLayer/layer_prepostprocess/layer_norm/layer_norm_scale/ConcatPartitions/concat", "shape": [512], "dtype": "float32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/FFN/conv2/Tensordot/Reshape_1", "shape": [1536, 512], "dtype": "float32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/FFN/conv1/Tensordot/Reshape_1", "shape": [512, 1536], "dtype": "float32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/FFN/layer_prepostprocess/layer_norm/layer_norm_bias/ConcatPartitions/concat", "shape": [512], "dtype": "float32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/FFN/layer_prepostprocess/layer_norm/layer_norm_scale/ConcatPartitions/concat", "shape": [512], "dtype": "float32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv1/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/FFN/conv1/bias/ConcatPartitions/concat", "shape": [1536], "dtype": "float32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv2/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/FFN/conv2/bias/ConcatPartitions/concat", "shape": [512], "dtype": "float32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/dense/kernel/ConcatPartitions/concat", "shape": [256, 512], "dtype": "float32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/dense/bias/ConcatPartitions/concat", "shape": [512], "dtype": "float32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/DotProductAttention/BaseDotProductAttention/Slice/begin", "shape": [1], "dtype": "int32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/mul/y", "shape": [], "dtype": "float32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/DotProductAttention/attention_bias_ignore_padding/mul/y", "shape": [], "dtype": "float32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/layer_prepostprocess/layer_norm/layer_norm_bias/ConcatPartitions/concat", "shape": [256], "dtype": "float32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/layer_prepostprocess/layer_norm/layer_norm_scale/ConcatPartitions/concat", "shape": [256], "dtype": "float32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/layer_prepostprocess/layer_norm/Cast/x", "shape": [], "dtype": "float32"}, {"name": "module/Embeddings_en", "shape": [8002, 256], "dtype": "float32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/AddTimingSignal/TimingSignal/ExpandDims_1", "shape": [1, 128], "dtype": "float32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv2/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "module/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/MultiheadAttention/qkv_transform_single/kernel/part_0", "shape": [1, 1, 256, 768], "dtype": "float32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/MultiheadAttention/qkv_transform_single/bias/ConcatPartitions/concat", "shape": [768], "dtype": "float32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/Const", "shape": [3], "dtype": "int32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/Reshape/shape/3", "shape": [], "dtype": "int32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/combine_heads/combine_last_two_dimensions/Reshape/shape/2", "shape": [], "dtype": "int32"}, {"name": "module/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/MultiheadAttention/output_transform_single/kernel/part_0", "shape": [1, 1, 256, 512], "dtype": "float32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/MultiheadAttention/output_transform_single/bias/ConcatPartitions/concat", "shape": [512], "dtype": "float32"}, {"name": "module/Encoder_en/KonaTransformer/Encode/Layer_1/TransformerLayer/MultiheadAttention/qkv_transform_single/kernel/part_0", "shape": [1, 1, 512, 1536], "dtype": "float32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_1/TransformerLayer/MultiheadAttention/qkv_transform_single/bias/ConcatPartitions/concat", "shape": [1536], "dtype": "float32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/Const", "shape": [3], "dtype": "int32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/Reshape/shape/2", "shape": [], "dtype": "int32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/Reshape/shape/3", "shape": [], "dtype": "int32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads/transpose/perm", "shape": [4], "dtype": "int32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/combine_heads/combine_last_two_dimensions/Reshape/shape/2", "shape": [], "dtype": "int32"}, {"name": "module/Encoder_en/KonaTransformer/Encode/Layer_1/TransformerLayer/MultiheadAttention/output_transform_single/kernel/part_0", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_1/TransformerLayer/MultiheadAttention/output_transform_single/bias/ConcatPartitions/concat", "shape": [512], "dtype": "float32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv1/Tensordot/add_1", "shape": [1], "dtype": "int32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/Scatter/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/SequenceMask/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/ClipToMaxLength/Const", "shape": [], "dtype": "int32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/ClipToMaxLength/ones_like", "shape": [2], "dtype": "int32"}, {"name": "ConstantFolding/module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv1/Tensordot/ListDiff-folded-0", "shape": [2], "dtype": "int32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/AddTimingSignal/strided_slice_2/stack_1", "shape": [2], "dtype": "int32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/AddTimingSignal/strided_slice_2/stack_2", "shape": [2], "dtype": "int32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/ClipToMaxLength/Less/y", "shape": [], "dtype": "int32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/layer_prepostprocess/layer_norm/Mean/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/SequenceMask/Const", "shape": [], "dtype": "int32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/SparseToDense/default_value", "shape": [], "dtype": "int32"}, {"name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/DotProductAttention/attention_bias_ignore_padding/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "module/Encoder_en/hidden_layers/tanh_layer_0/weights", "shape": [512, 512], "dtype": "float32"}, {"name": "module/Encoder_en/hidden_layers/tanh_layer_0/bias", "shape": [512], "dtype": "float32"}]}], "convertedBy": "TensorFlow.js Converter v1.7.2", "userDefinedMetadata": {"signature": {"inputs": {"values:0": {"tensorShape": {"dim": [{"size": "-1"}]}, "name": "values:0", "dtype": "DT_INT64"}, "indices:0": {"tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}, "name": "indices:0", "dtype": "DT_INT64"}}, "outputs": {"module_apply_default/Encoder_en/hidden_layers/l2_normalize:0": {"tensorShape": {"dim": [{"size": "-1"}, {"size": "512"}]}, "name": "module_apply_default/Encoder_en/hidden_layers/l2_normalize:0", "dtype": "DT_FLOAT"}}}}, "format": "graph-model", "modelTopology": {"node": [{"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "module_apply_default/Encoder_en/hidden_layers/l2_normalize/Maximum/y"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1536"}, {"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv2/Tensordot/Reshape_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}, {"size": "1536"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv1/Tensordot/Reshape_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_1/TransformerLayer/FFN/layer_prepostprocess/layer_norm/layer_norm_bias/ConcatPartitions/concat"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_1/TransformerLayer/FFN/layer_prepostprocess/layer_norm/layer_norm_scale/ConcatPartitions/concat"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1536"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_1/TransformerLayer/FFN/conv1/bias/ConcatPartitions/concat"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_1/TransformerLayer/FFN/conv2/bias/ConcatPartitions/concat"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/mul/y"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_1/TransformerLayer/layer_prepostprocess/layer_norm/layer_norm_bias/ConcatPartitions/concat"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_1/TransformerLayer/layer_prepostprocess/layer_norm/layer_norm_scale/ConcatPartitions/concat"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1536"}, {"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/FFN/conv2/Tensordot/Reshape_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}, {"size": "1536"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/FFN/conv1/Tensordot/Reshape_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/FFN/layer_prepostprocess/layer_norm/layer_norm_bias/ConcatPartitions/concat"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/FFN/layer_prepostprocess/layer_norm/layer_norm_scale/ConcatPartitions/concat"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv1/Tensordot/Const_2"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1536"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/FFN/conv1/bias/ConcatPartitions/concat"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv2/Tensordot/Const_2"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/FFN/conv2/bias/ConcatPartitions/concat"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "256"}, {"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/dense/kernel/ConcatPartitions/concat"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/dense/bias/ConcatPartitions/concat"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/DotProductAttention/BaseDotProductAttention/Slice/begin"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/mul/y"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/DotProductAttention/attention_bias_ignore_padding/mul/y"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "256"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/layer_prepostprocess/layer_norm/layer_norm_bias/ConcatPartitions/concat"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "256"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/layer_prepostprocess/layer_norm/layer_norm_scale/ConcatPartitions/concat"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/layer_prepostprocess/layer_norm/Cast/x"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "8002"}, {"size": "256"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "module/Embeddings_en"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/AddTimingSignal/TimingSignal/ExpandDims_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv2/Tensordot/Const"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "768"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "module/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/MultiheadAttention/qkv_transform_single/kernel/part_0"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "768"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/MultiheadAttention/qkv_transform_single/bias/ConcatPartitions/concat"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/Const"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/Reshape/shape/3"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/combine_heads/combine_last_two_dimensions/Reshape/shape/2"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "module/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/MultiheadAttention/output_transform_single/kernel/part_0"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/MultiheadAttention/output_transform_single/bias/ConcatPartitions/concat"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "1536"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "module/Encoder_en/KonaTransformer/Encode/Layer_1/TransformerLayer/MultiheadAttention/qkv_transform_single/kernel/part_0"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1536"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_1/TransformerLayer/MultiheadAttention/qkv_transform_single/bias/ConcatPartitions/concat"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/Const"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/Reshape/shape/2"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/Reshape/shape/3"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "4"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads/transpose/perm"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/combine_heads/combine_last_two_dimensions/Reshape/shape/2"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "module/Encoder_en/KonaTransformer/Encode/Layer_1/TransformerLayer/MultiheadAttention/output_transform_single/kernel/part_0"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_1/TransformerLayer/MultiheadAttention/output_transform_single/bias/ConcatPartitions/concat"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv1/Tensordot/add_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/Scatter/strided_slice/stack"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/SequenceMask/ExpandDims/dim"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/ExpandDims/dim"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT64"}}, "dtype": {"type": "DT_INT64"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/ClipToMaxLength/Const"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "2"}]}, "dtype": "DT_INT64"}}, "dtype": {"type": "DT_INT64"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/ClipToMaxLength/ones_like"}, {"op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "2"}]}}, "dtype": {"type": "DT_INT64"}}, "name": "indices"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "2"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "ConstantFolding/module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv1/Tensordot/ListDiff-folded-0"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "2"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/AddTimingSignal/strided_slice_2/stack_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "2"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/AddTimingSignal/strided_slice_2/stack_2"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT64"}}, "dtype": {"type": "DT_INT64"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/ClipToMaxLength/Less/y"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/layer_prepostprocess/layer_norm/Mean/reduction_indices"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/SequenceMask/Const"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT64"}}, "dtype": {"type": "DT_INT64"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/SparseToDense/default_value"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/DotProductAttention/attention_bias_ignore_padding/ExpandDims/dim"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}, {"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "module/Encoder_en/hidden_layers/tanh_layer_0/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "module/Encoder_en/hidden_layers/tanh_layer_0/bias"}, {"op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}, "name": "values"}, {"op": "StridedSlice", "attr": {"begin_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT64"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "2"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/ClipToMaxLength/strided_slice", "input": ["indices", "ConstantFolding/module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv1/Tensordot/ListDiff-folded-0", "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/AddTimingSignal/strided_slice_2/stack_1", "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/AddTimingSignal/strided_slice_2/stack_2"]}, {"op": "Less", "attr": {"T": {"type": "DT_INT64"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/ClipToMaxLength/Less", "input": ["module_apply_default/Encoder_en/KonaTransformer/ClipToMaxLength/strided_slice", "module_apply_default/Encoder_en/KonaTransformer/ClipToMaxLength/Less/y"]}, {"op": "Where", "attr": {"T": {"type": "DT_BOOL"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/ClipToMaxLength/Where", "input": ["module_apply_default/Encoder_en/KonaTransformer/ClipToMaxLength/Less"]}, {"op": "Reshape", "attr": {"T": {"type": "DT_INT64"}, "Tshape": {"type": "DT_INT32"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/ClipToMaxLength/Reshape", "input": ["module_apply_default/Encoder_en/KonaTransformer/ClipToMaxLength/Where", "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/layer_prepostprocess/layer_norm/Mean/reduction_indices"]}, {"op": "GatherV2", "attr": {"Tparams": {"type": "DT_INT64"}, "batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT64"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/ClipToMaxLength/GatherV2", "input": ["indices", "module_apply_default/Encoder_en/KonaTransformer/ClipToMaxLength/Reshape", "module_apply_default/Encoder_en/KonaTransformer/SequenceMask/Const"]}, {"op": "GatherV2", "attr": {"Tparams": {"type": "DT_INT64"}, "batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT64"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/ClipToMaxLength/GatherV2_1", "input": ["values", "module_apply_default/Encoder_en/KonaTransformer/ClipToMaxLength/Reshape", "module_apply_default/Encoder_en/KonaTransformer/SequenceMask/Const"]}, {"op": "Max", "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT64"}, "keep_dims": {"b": false}}, "name": "module_apply_default/Encoder_en/KonaTransformer/ClipToMaxLength/Max", "input": ["module_apply_default/Encoder_en/KonaTransformer/ClipToMaxLength/GatherV2", "module_apply_default/Encoder_en/KonaTransformer/SequenceMask/Const"]}, {"op": "GatherV2", "attr": {"Tparams": {"type": "DT_FLOAT"}, "batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT64"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/embedding_lookup", "input": ["module/Embeddings_en", "module_apply_default/Encoder_en/KonaTransformer/ClipToMaxLength/GatherV2_1", "module_apply_default/Encoder_en/KonaTransformer/SequenceMask/Const"]}, {"op": "Add", "attr": {"T": {"type": "DT_INT64"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/ClipToMaxLength/Add", "input": ["module_apply_default/Encoder_en/KonaTransformer/ClipToMaxLength/Max", "module_apply_default/Encoder_en/KonaTransformer/ClipToMaxLength/ones_like"]}, {"op": "Shape", "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Scatter/Shape", "input": ["module_apply_default/Encoder_en/KonaTransformer/Encode/embedding_lookup"]}, {"op": "Maximum", "attr": {"T": {"type": "DT_INT64"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/ClipToMaxLength/Maximum", "input": ["module_apply_default/Encoder_en/KonaTransformer/ClipToMaxLength/Const", "module_apply_default/Encoder_en/KonaTransformer/ClipToMaxLength/Add"]}, {"op": "StridedSlice", "attr": {"begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Scatter/strided_slice", "input": ["module_apply_default/Encoder_en/KonaTransformer/Encode/Scatter/Shape", "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/Scatter/strided_slice/stack", "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv2/Tensordot/Const", "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/Scatter/strided_slice/stack"]}, {"op": "SparseToDense", "attr": {"T": {"type": "DT_INT64"}, "validate_indices": {"b": true}, "Tindices": {"type": "DT_INT64"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/SparseToDense", "input": ["module_apply_default/Encoder_en/KonaTransformer/ClipToMaxLength/GatherV2", "module_apply_default/Encoder_en/KonaTransformer/ClipToMaxLength/Maximum", "module_apply_default/Encoder_en/KonaTransformer/ClipToMaxLength/GatherV2_1", "module_apply_default/Encoder_en/KonaTransformer/Encode/SparseToDense/default_value"]}, {"op": "Greater", "attr": {"T": {"type": "DT_INT64"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Greater", "input": ["module_apply_default/Encoder_en/KonaTransformer/Encode/SparseToDense", "module_apply_default/Encoder_en/KonaTransformer/Encode/SparseToDense/default_value"]}, {"op": "LogicalNot", "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/DotProductAttention/LogicalNot", "input": ["module_apply_default/Encoder_en/KonaTransformer/Encode/Greater"]}, {"op": "Shape", "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_BOOL"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/StoreMask/Shape", "input": ["module_apply_default/Encoder_en/KonaTransformer/Encode/Greater"]}, {"op": "Where", "attr": {"T": {"type": "DT_BOOL"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/StoreMask/Where", "input": ["module_apply_default/Encoder_en/KonaTransformer/Encode/Greater"]}, {"op": "Cast", "attr": {"SrcT": {"type": "DT_BOOL"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/MaskLength/ToInt32", "input": ["module_apply_default/Encoder_en/KonaTransformer/Encode/Greater"]}, {"op": "Cast", "attr": {"SrcT": {"type": "DT_BOOL"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/DotProductAttention/ToFloat", "input": ["module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/DotProductAttention/LogicalNot"]}, {"op": "ConcatV2", "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Scatter/concat", "input": ["module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/StoreMask/Shape", "module_apply_default/Encoder_en/KonaTransformer/Encode/Scatter/strided_slice", "module_apply_default/Encoder_en/KonaTransformer/SequenceMask/Const"]}, {"op": "Cast", "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/StoreMask/ToInt32", "input": ["module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/StoreMask/Where"]}, {"op": "StridedSlice", "attr": {"begin_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT64"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "2"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/AddTimingSignal/strided_slice_2", "input": ["module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/StoreMask/Where", "ConstantFolding/module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv1/Tensordot/ListDiff-folded-0", "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/AddTimingSignal/strided_slice_2/stack_1", "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/AddTimingSignal/strided_slice_2/stack_2"]}, {"op": "Sum", "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "keep_dims": {"b": false}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/MaskLength/Sum", "input": ["module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/MaskLength/ToInt32", "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/DotProductAttention/attention_bias_ignore_padding/ExpandDims/dim"]}, {"op": "Mul", "attr": {"T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/DotProductAttention/attention_bias_ignore_padding/mul", "input": ["module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/DotProductAttention/ToFloat", "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/DotProductAttention/attention_bias_ignore_padding/mul/y"]}, {"op": "ScatterNd", "attr": {"T": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Scatter/ScatterNd", "input": ["module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/StoreMask/ToInt32", "module_apply_default/Encoder_en/KonaTransformer/Encode/embedding_lookup", "module_apply_default/Encoder_en/KonaTransformer/Encode/Scatter/concat"]}, {"op": "Cast", "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/AddTimingSignal/TimingSignal/ToFloat_2", "input": ["module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/AddTimingSignal/strided_slice_2"]}, {"op": "ExpandDims", "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/SequenceMask/ExpandDims", "input": ["module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/MaskLength/Sum", "module_apply_default/Encoder_en/KonaTransformer/SequenceMask/ExpandDims/dim"]}, {"op": "Maximum", "attr": {"T": {"type": "DT_INT32"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Maximum", "input": ["module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/MaskLength/Sum", "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/DotProductAttention/attention_bias_ignore_padding/ExpandDims/dim"]}, {"op": "ExpandDims", "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/DotProductAttention/attention_bias_ignore_padding/ExpandDims", "input": ["module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/DotProductAttention/attention_bias_ignore_padding/mul", "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/DotProductAttention/attention_bias_ignore_padding/ExpandDims/dim"]}, {"op": "GatherNd", "attr": {"Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/AddTimingSignal/Gather/GatherNd", "input": ["module_apply_default/Encoder_en/KonaTransformer/Encode/Scatter/ScatterNd", "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/StoreMask/ToInt32"]}, {"op": "ExpandDims", "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/AddTimingSignal/TimingSignal/ExpandDims", "input": ["module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/AddTimingSignal/TimingSignal/ToFloat_2", "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/DotProductAttention/attention_bias_ignore_padding/ExpandDims/dim"]}, {"op": "Cast", "attr": {"SrcT": {"type": "DT_INT32"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}, "name": "module_apply_default/Encoder_en/KonaTransformer/ToFloat_1", "input": ["module_apply_default/Encoder_en/KonaTransformer/Maximum"]}, {"op": "ExpandDims", "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/DotProductAttention/attention_bias_ignore_padding/ExpandDims_1", "input": ["module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/DotProductAttention/attention_bias_ignore_padding/ExpandDims", "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/DotProductAttention/attention_bias_ignore_padding/ExpandDims/dim"]}, {"op": "Mul", "attr": {"T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/AddTimingSignal/TimingSignal/mul_2", "input": ["module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/AddTimingSignal/TimingSignal/ExpandDims", "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/AddTimingSignal/TimingSignal/ExpandDims_1"]}, {"op": "ExpandDims", "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/ExpandDims_1", "input": ["module_apply_default/Encoder_en/KonaTransformer/ToFloat_1", "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/DotProductAttention/attention_bias_ignore_padding/ExpandDims/dim"]}, {"op": "Sin", "attr": {"T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/AddTimingSignal/TimingSignal/Sin", "input": ["module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/AddTimingSignal/TimingSignal/mul_2"]}, {"op": "Cos", "attr": {"T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/AddTimingSignal/TimingSignal/Cos", "input": ["module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/AddTimingSignal/TimingSignal/mul_2"]}, {"op": "ConcatV2", "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/AddTimingSignal/TimingSignal/concat", "input": ["module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/AddTimingSignal/TimingSignal/Sin", "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/AddTimingSignal/TimingSignal/Cos", "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/DotProductAttention/attention_bias_ignore_padding/ExpandDims/dim"]}, {"op": "Add", "attr": {"T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/AddTimingSignal/add", "input": ["module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/AddTimingSignal/Gather/GatherNd", "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/AddTimingSignal/TimingSignal/concat"]}, {"op": "Shape", "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/AddTimingSignal/Scatter/Shape", "input": ["module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/AddTimingSignal/add"]}, {"op": "StridedSlice", "attr": {"begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/AddTimingSignal/Scatter/strided_slice", "input": ["module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/AddTimingSignal/Scatter/Shape", "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/Scatter/strided_slice/stack", "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv2/Tensordot/Const", "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/Scatter/strided_slice/stack"]}, {"op": "ConcatV2", "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/AddTimingSignal/Scatter/concat", "input": ["module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/StoreMask/Shape", "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/AddTimingSignal/Scatter/strided_slice", "module_apply_default/Encoder_en/KonaTransformer/SequenceMask/Const"]}, {"op": "ScatterNd", "attr": {"T": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/AddTimingSignal/Scatter/ScatterNd", "input": ["module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/StoreMask/ToInt32", "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/AddTimingSignal/add", "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/AddTimingSignal/Scatter/concat"]}, {"op": "Add", "attr": {"T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/add", "input": ["module_apply_default/Encoder_en/KonaTransformer/Encode/Scatter/ScatterNd", "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/AddTimingSignal/Scatter/ScatterNd"]}, {"op": "GatherNd", "attr": {"Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/AdjustResidualInput/Gather/GatherNd", "input": ["module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/add", "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/StoreMask/ToInt32"]}, {"op": "Mean", "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}, "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/layer_prepostprocess/layer_norm/Mean", "input": ["module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/add", "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/layer_prepostprocess/layer_norm/Mean/reduction_indices"]}, {"op": "_FusedMatMul", "device": "/device:CPU:0", "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/AdjustResidualInput/dense/BiasAdd", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}, "input": ["module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/AdjustResidualInput/Gather/GatherNd", "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/dense/kernel/ConcatPartitions/concat", "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/dense/bias/ConcatPartitions/concat"]}, {"op": "Sub", 